alert("Сьогодні на наших екранах буде представленна метаматична вікторина. Буде озвучено десять питань. За кожне питання студент отримує один бал. В результаті на ваших екранах з'являться результати вікторини.");
let n = 0;
console.log('Зараз ваша кількість балів сягає ' + n);
let test = prompt("Скільки буде 2+2");
if (test == 4) {
    console.log("Це вірно. Отримай +1 бал");
    n++
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == null) {
    console.log("Ви пропустили це запитання. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test === "") {
    console.log("Ти не дав жодної відповіді. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else {
    console.log("Вірна відповідь зовсім інша. Ти втрачаєш 1 бал");
    console.log('Зараз ваша кількість балів сягає ' + n);
}
test = prompt("Скільки буде 100-100");
if (test == 0) {
    console.log("Це вірно. Отримай +1 бал");
    n++
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == null) {
    console.log("Ви пропустили це запитання. Продовжуємо далі.")
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == "") {
    console.log("Ти не дав жодної відповіді. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else {
    console.log("Вірна відповідь зовсім інша. Ти втрачаєш 1 бал");
    console.log('Зараз ваша кількість балів сягає ' + n);
}
test = prompt("Скільки буде 100*2");
if (test == 200) {
    console.log("Це вірно. Отримай +1 бал");
    n++
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == null) {
    console.log("Ви пропустили це запитання. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test === "") {
    console.log("Ти не дав жодної відповіді. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else {
    console.log("Вірна відповідь зовсім інша. Ти втрачаєш 1 бал");
    console.log('Зараз ваша кількість балів сягає ' + n);
}
test = prompt("Скільки буде 2+2*2");
if (test == 6) {
    console.log("Це вірно. Отримай +1 бал");
    n++
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == null) {
    console.log("Ви пропустили це запитання. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test === "") {
    console.log("Ти не дав жодної відповіді. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else {
    console.log("Вірна відповідь зовсім інша. Ти втрачаєш 1 бал");
    console.log('Зараз ваша кількість балів сягає ' + n);
}
test = prompt("Скільки буде 9-9+9+9-9+9+1");
if (test == 1) {
    console.log("Це вірно. Отримай +1 бал");
    n++
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == null) {
    console.log("Ви пропустили це запитання. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test === "") {
    console.log("Ти не дав жодної відповіді. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else {
    console.log("Вірна відповідь зовсім інша. Ти втрачаєш 1 бал");
    console.log('Зараз ваша кількість балів сягає ' + n);
}
test = prompt("Скільки буде 123456789-98765432");
if (test == 24691357) {
    console.log("Це вірно. Отримай +1 бал");
    n++
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == null) {
    console.log("Ви пропустили це запитання. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test === "") {
    console.log("Ти не дав жодної відповіді. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else {
    console.log("Вірна відповідь зовсім інша. Ти втрачаєш 1 бал");
    console.log('Зараз ваша кількість балів сягає ' + n);
}
test = prompt("Скільки буде 49/7");
if (test == 7) {
    console.log("Це вірно. Отримай +1 бал");
    n++
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == null) {
    console.log("Ви пропустили це запитання. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test === "") {
    console.log("Ти не дав жодної відповіді. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else {
    console.log("Вірна відповідь зовсім інша. Ти втрачаєш 1 бал");
    console.log('Зараз ваша кількість балів сягає ' + n);
}
test = prompt("Скільки буде 15*4+10");
if (test == 100) {
    console.log("Це вірно. Отримай +1 бал");
    n++
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test == null) {
    console.log("Ви пропустили це запитання. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else if (test === "") {
    console.log("Ти не дав жодної відповіді. Продовжуємо далі.");
    console.log('Зараз ваша кількість балів сягає ' + n);
} else {
    console.log("Вірна відповідь зовсім інша. Ти втрачаєш 1 бал");
    console.log('Зараз ваша кількість балів сягає ' + n);
}
alert("На цьому вікторина закінчилася. Загальна кількість твоїх балів сягає " + n + ' балів');
if (n >= 0 && n <= 2) {
    alert('Мої вітання. Ти лузер.');
} else if (n >= 3 && n <= 5) {
    alert('Мої вітання. Ти добре старався.');
} else if (n >= 6 && n <= 8) {
    alert('Мої вітання. Ти дуже розумний.');
}