alert('Дізнаємося яке число відповідає за кожну пору року');
let n = prompt('Введіть число');
if (n == 12 || n == 1 || n == 2) {
    alert('Число під номером ' + n + ' - Зима');
}
else if (n == 3 || n == 4 || n == 5) {
    alert('Місяць під номером ' + n + ' - Весна');
}
else if (n == 6 || n == 7 || n == 8) {
    alert('Місяць під номером ' + n + ' - Літо');
}
else if (n == 9 || n == 10 || n == 11) {
    alert('Місяць під номером ' + n + ' - Осінь');
}
else if (n > 12) {
    alert('Некоректне число.')
}